## Imports

In [2]:
import numpy as np
import matplotlib as plt
import pandas as pd

## Data

In [4]:
df = pd.read_csv('../data/titanic.txt')   # .read_csv works even with .txt file
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

## Problems

In [11]:
len( df[(df['Survived'] == 1) &  (df['Fare'] >= 100)])  /  len(df[df['Fare'] >= 100]) *100

73.58490566037736

In [23]:

df_tennis = pd.read_csv('../data/tennis.txt', delimiter="\t", header=None, names=['Outlook', 'Temp', 'Humidity', 'Wind', 'Decision'])
df_tennis

     Outlook  Temp Humidity    Wind Decision
1      Sunny   Hot     High    Weak       No
2      Sunny   Hot     High  Strong       No
3   Overcast   Hot     High    Weak      Yes
4       Rain  Mild     High    Weak      Yes
5       Rain  Cool   Normal    Weak      Yes
6       Rain  Cool   Normal  Strong       No
7   Overcast  Cool   Normal  Strong      Yes
8      Sunny  Mild     High    Weak       No
9      Sunny  Cool   Normal    Weak      Yes
10      Rain  Mild   Normal    Weak      Yes
11     Sunny  Mild   Normal  Strong      Yes
12  Overcast  Mild     High  Strong      Yes
13  Overcast   Hot   Normal    Weak      Yes
14      Rain  Mild     High  Strong       No

In [32]:
def conditional_prob(value1, value2, condition):
    set1 = df_tennis[df_tennis[value1] == condition][value2]
    set1 = set1.unique()
    pop = len(set1)
    prob={}
    for i in set1:
        prob[i] = len(df_tennis[(df_tennis[value1] == condition) & (df_tennis[value2]== i)]) / (pop)
        print(prob[i])
    return prob
        
        
print(conditional_prob('Wind', 'Decision', 'Weak'))

1.0
3.0
{'No': 1.0, 'Yes': 3.0}